# vstGetDataLong

## Description
```pascal
PROCEDURE vstGetDataLong(
				inDataID    : LONGINT;
				VAR outData : LONGINT;
				VAR result  : BOOLEAN);
```

```python

def vs.vstGetDataLong(inDataID):
    return (outData, result)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inDataID|LONGINT||
|outData|LONGINT||
|result|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events